[{"title": "weather prediction project", "content": "Team project - Each team will find 10 years' worth of historical atmospheric data (weather) for Sandusky, Ohio, for 5 days in July, starting with July 18 and ending July 22.\r\n\r\nThe data needs to include, but is not limited to, Temperature, Humidity, average wind speed and Direction, and precipitation (rain). Also, see if there is any historical data of Severe weather during these dates.\r\n\r\nUsing your new Data Visualization skill, determine if there are any patterns in the weather and show them to me visually. You will be presenting this to me and the class.\r\n\r\nCome up with a prediction of the weather for July 20 based on your data.\r\n\r\nI will give your team extra credit if you can find the water temperature for the last 10 years and can show that in a graph.", "image": "Screenshot_2025-04-24_093648.png"}, {"title": "a program that creates a Dictionary of Candies using the name of the person and the candy they would like", "content": "Your program should also allow you to update the file with new names and candy and write these new additions to the file.\r\n\r\nPlease make sure that there is no way to cause the program to crash because of the wrong input.\r\n\r\nPlease display the different candies without duplicates with a statement that shows both; the name of the person that requested the candy and the candy they would like.\r\n\r\nfor example, if Alex and Joe both select Kit Kats your program should show on one line that Alex and Joe would like Kit Kats on individual lines.", "image": "Screenshot_2025-05-01_083024.png"}, {"title": "program that calculate the revenue from Buildings and Villas and displays the Asset's name, address, and total revenue", "content": "Write Python classes to represent Apartment, Building, and Villa.\r\n\r\nBuilding and Villa inherit from the class Asset.\r\nThe class Asset has a name, address, and revenue as attributes, where revenue is a float value.\r\nA Villa is an Asset that has rent and maintenance, both are float values.\r\nA Building is an Asset that has a number of apartments.\r\nAn Apartment has rent and maintenance, both are float values.\r\nAll the revenue and rent attributes are private.\r\nEach class has a revenue() method to calculate the monthly revenue as shown below.\r\nYour program needs to calculate the revenue from Buildings and Villas and display the Asset's name, address, and total revenue. Test the program to display the details of all assets. If a particular asset does not generate any revenue, an appropriate exception is thrown to indicate the same.\r\n\r\nFormulas:\r\n\r\nRevenue of Villa = rent – maintenance\r\nRevenue of Building = (number of apartments x apartment rent) – (maintenance x number of apartments)\r\nThe student is required to identify classes, related attributes, and behaviors. Students are free to add as many attributes as required. The appropriate access modifiers (private, public, or protected) must be used while implementing class relationships. Proper documentation of code is mandatory. The student must also test the code by creating at least three objects. All classes must have a display function, and the program must have the functionality to print the current state of the objects.", "image": "Screenshot_2025-05-01_084023.png"}, {"title": "a dictionary from user inputs that checks to see if the user input is in a dictionary of popular fast-food restaurants. The key is the name of the student, and the values are a list of different fast-food restaurants", "content": "Create a list from an input that includes 5 fast food restaurants.\r\n\r\nCreate a dictionary from user input and then check to see if the user input is in a dictionary of popular fast-food restaurants. The key should be the name of the student, and the values should be a list of different fast-food restaurants.\r\n\r\nInclude 8 students' fast food restaurants in your dictionary. Write a while loop that will loop until 8 students have answered your survey. You should also create a loop that allows students to add multiple entries to the dictionary.\r\n\r\n Check to see If the input fast food restaurant is in your original list. If not on the list add it to your list. Make sure no duplicates are in your list. \r\n\r\nYou can use any reference except your book for this program.", "image": "Screenshot_2025-05-01_084341.png"}]